[
  {
    "path": "posts/week1/",
    "title": "Week 1 - Welcome to rbtl!",
    "description": "In our first lecture, we will discuss the objectives and intentions of the course, begin our discussion on terminology and get to know each other.",
    "author": [],
    "date": "2022-02-24",
    "categories": [],
    "contents": "\n\nContents\nLearning Objectives\nPart 1\nPart 2\n\nSlides\nGroup work\nPapers\n\nHomework\n\n\n\n\n\n\n\n\nFigure 1: Photo by Jaromír Kavan\n\n\n\nLearning Objectives\nThis first lectures consists of two parts, each of which have specific learning objectives.\nPart 1\n\n\n\nLearners understand the structure of the course, including expectations and outputs\nLearners will be able to articulate the assumptions and histories associated with “field work”\nPart 2\n\n\n\nLearners can navigate the platforms that are used to distribute course information\nLearners can create a repository on GitHub\nLearners can edit a file on GitHub\nSlides\n\n\ntitle\n\n\nlecturer\n\n\npart\n\n\nslides\n\n\nIntroduction to rbtl\n\n\nE. Tilley\n\n\nPart 1\n\n\nAccess slides on Moodle\n\n\nWelcome to the course!\n\n\nL. Schöbitz\n\n\nPart 2\n\n\nAccess slides in browser\n\n\nGroup work\nDecide, within your group, who will take each of the five papers in (groups of 5: 1 person for each paper)\nRead your paper for next class. Pay close attention to:\nThe research question\nThe methods the authors use to collect their data\nThe variables (and units) that are measured\nThe types of analysis that is used to answer the research question\n\nYou will use your paper to inspire conversations within your group as you work through the subsequent exercises in the coming weeks.\nEnjoy!\nPapers\nO’Brien, J., & Thondhlana, G. (2019). Plastic bag use in South Africa: Perceptions, practices and potential intervention strategies. Waste Management, 84, 320-328.\nFerronato, N., Preziosi, G., Portillo, M. A. G., Lizarazu, E. G. G., & Torretta, V. (2020). Assessment of municipal solid waste selective collection scenarios with geographic information systems in Bolivia. Waste Management, 102, 919-931.\nNemathaga, F., Maringa, S., & Chimuka, L. (2008). Hospital solid waste management practices in Limpopo Province, South Africa: A case study of two hospitals. Waste Management, 28(7), 1236-1245.\nPathak, D. R., Mainali, B., Abuel-Naga, H., Angove, M., & Kong, I. (2020). Quantification and characterization of the municipal solid waste for sustainable waste management in newly formed municipalities of Nepal. Waste Management & Research, 38(9), 1007-1018.\nPhilippe, F., & Culot, M. (2009). Household solid waste generation and characteristics in Cape Haitian city, Republic of Haiti. Resources, Conservation and Recycling, 54(2), 73-78.\nHomework\n\n\nid\n\n\ntitle_link\n\n\ntype\n\n\ncategory\n\n\neffort_estimate_min\n\n\nsubmission_format\n\n\ndue_date\n\n\n1\n\n\nWeek 1 - Hello GitHub\n\n\nassignment\n\n\nrequired\n\n\n45\n\n\nGitHub\n\n\n2022-03-01\n\n\n2\n\n\nRead the Syllabus carefully\n\n\nreading\n\n\nrequired\n\n\n15\n\n\nno submission\n\n\n\n\n3\n\n\nWhat is open source?\n\n\nreading\n\n\nrequired\n\n\n15\n\n\nno submission\n\n\n\n\n4\n\n\nExcuse Me, Do You Have a Moment to Talk About Version Control?\n\n\nreading\n\n\nrecommended\n\n\n30\n\n\nno submission\n\n\n\n\n5\n\n\nReproducible? Replicable? Robust? Generalisable?\n\n\nreading\n\n\nrecommended\n\n\n10\n\n\nno submission\n\n\n\n\n6\n\n\nSix arguments why you benefit from reproducible workflows to your research\n\n\nreading\n\n\nrecommended\n\n\n10\n\n\nno submission\n\n\n\n\n\n\n\n",
    "preview": "posts/week1/img/roadmap.jpg",
    "last_modified": "2022-02-23T15:28:38+01:00",
    "input_file": {}
  }
]
